In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame([[3, 2, 5], [10, 0, 2], [6, 5, 3]],
                   columns=["사과", "자두", "포도"],
                   index=["이성계", "김유신", "이순신"])
s1 = df1["사과"]

In [3]:
df1

     사과  자두  포도
이성계   3   2   5
김유신  10   0   2
이순신   6   5   3

In [4]:
s1

이성계     3
김유신    10
이순신     6
Name: 사과, dtype: int64

In [5]:
df1.sum()

사과    19
자두     7
포도    10
dtype: int64

In [6]:
df1.values

array([[ 3,  2,  5],
       [10,  0,  2],
       [ 6,  5,  3]])

In [7]:
df1.values > 3

array([[False, False,  True],
       [ True, False, False],
       [ True,  True, False]])

In [8]:
df1 > 3

        사과     자두     포도
이성계  False  False   True
김유신   True  False  False
이순신   True   True  False

In [9]:
df1.index

Index(['이성계', '김유신', '이순신'], dtype='object')

In [10]:
df1.columns

Index(['사과', '자두', '포도'], dtype='object')

In [11]:
s1.index

Index(['이성계', '김유신', '이순신'], dtype='object')

In [12]:
s1.sum()

19

In [13]:
s1.values

array([ 3, 10,  6])

In [14]:
s1.values > 3

array([False,  True,  True])

In [15]:
s1 > 3

이성계    False
김유신     True
이순신     True
Name: 사과, dtype: bool

In [16]:
df2 = pd.read_excel("E00EXAMPLE.xlsx").set_index("이름")
df2

     국어  영어  수학  과학
이름
강동원  63  93  67  71
송중기  89  83  71  80
기태영  83  76  92  98
김남길  94  88  73  93
류준열  71  83  80  88
박성균  67  87  92  90

In [17]:
df2.index

Index(['강동원', '송중기', '기태영', '김남길', '류준열', '박성균'], dtype='object', name='이름')